["```\nNetwork Working Group                                          D. Libes\nRequest for Comments: 1178                Integrated Systems Group/NIST\nFYI: 5                                                      August 1990\n\n                   Choosing a Name for Your Computer\n\nStatus of this Memo\n\n   This FYI RFC is a republication of a Communications of the ACM\n   article on guidelines on what to do and what not to do when naming\n   your computer [1].  This memo provides information for the Internet\n   community.  It does not specify any standard.\n\n   Distribution of this memo is unlimited.\n\nAbstract\n\n   In order to easily distinguish between multiple computers, we give\n   them names.  Experience has taught us that it is as easy to choose\n   bad names as it is to choose good ones.  This essay presents\n   guidelines for deciding what makes a name good or bad.\n\n   Keywords: domain name system, naming conventions, computer\n   administration, computer network management\n\nIntroduction\n\n   As soon as you deal with more than one computer, you need to\n   distinguish between them.  For example, to tell your system\n   administrator that your computer is busted, you might say, \"Hey Ken.\n   Goon is down!\"\n\n   Computers also have to be able to distinguish between themselves.\n   Thus, when sending mail to a colleague at another computer, you might\n   use the command \"mail libes@goon\".\n\n   In both cases, \"goon\" refers to a particular computer.  How the name\n   is actually dereferenced by a human or computer need not concern us\n   here.  This essay is only concerned with choosing a \"good\" name.  (It\n   is assumed that the reader has a basic understanding of the domain\n   name system as described by [2].)\n\n   By picking a \"good\" name for your computer, you can avoid a number of\n   problems that people stumble over again and again.\n\n   Here are some guidelines on what NOT to do.\n\nLibes                                                           [Page 1]\n```", "```\n [RFC 1178](/doc/html/rfc1178)                   Name Your Computer                August 1990\n\n      Don't overload other terms already in common use.\n\n         Using a word that has strong semantic implications in the\n         current context will cause confusion.  This is especially true\n         in conversation where punctuation is not obvious and grammar is\n         often incorrect.\n\n         For example, a distributed database had been built on top of\n         several computers.  Each one had a different name.  One machine\n         was named \"up\", as it was the only one that accepted updates.\n         Conversations would sound like this: \"Is up down?\"  and \"Boot\n         the machine up.\" followed by \"Which machine?\"\n\n         While it didn't take long to catch on and get used to this\n         zaniness, it was annoying when occasionally your mind would\n         stumble, and you would have to stop and think about each word\n         in a sentence.  It is as if, all of a sudden, English has\n         become a foreign language.\n\n      Don't choose a name after a project unique to that machine.\n\n         A manufacturing project had named a machine \"shop\" since it was\n         going to be used to control a number of machines on a shop\n         floor.  A while later, a new machine was acquired to help with\n         some of the processing.  Needless to say, it couldn't be called\n         \"shop\" as well.  Indeed, both machines ended up performing more\n         specific tasks, allowing more precision in naming.  A year\n         later, five new machines were installed and the original one\n         was moved to an unrelated project.  It is simply impossible to\n         choose generic names that remain appropriate for very long.\n\n         Of course, they could have called the second one \"shop2\" and so\n         on.  But then one is really only distinguishing machines by\n         their number.  You might as well just call them \"1\", \"2\", and\n         \"3\".  The only time this kind of naming scheme is appropriate\n         is when you have a lot of machines and there are no reasons for\n         any human to distinguish between them.  For example, a master\n         computer might be controlling an array of one hundred\n         computers.  In this case, it makes sense to refer to them with\n         the array indices.\n\n         While computers aren't quite analogous to people, their names\n         are.  Nobody expects to learn much about a person by their\n         name.  Just because a person is named \"Don\" doesn't mean he is\n         the ruler of the world (despite what the \"Choosing a Name for\n         your Baby\" books say).  In reality, names are just arbitrary\n         tags.  You cannot tell what a person does for a living, what\n         their hobbies are, and so on.\n\nLibes                                                           [Page 2]\n```", "```\n [RFC 1178](/doc/html/rfc1178)                   Name Your Computer                August 1990\n\n      Don't use your own name.\n\n         Even if a computer is sitting on your desktop, it is a mistake\n         to name it after yourself.  This is another case of\n         overloading, in which statements become ambiguous.  Does \"give\n         the disk drive to don\" refer to a person or computer?\n\n         Even using your initials (or some other moniker) is\n         unsatisfactory.  What happens if I get a different machine\n         after a year?  Someone else gets stuck with \"don\" and I end up\n         living with \"jim\".  The machines can be renamed, but that is\n         excess work and besides, a program that used a special\n         peripheral or database on \"don\" would start failing when it\n         wasn't found on the \"new don\".\n\n         It is especially tempting to name your first computer after\n         yourself, but think about it.  Do you name any of your other\n         possessions after yourself?  No.  Your dog has its own name, as\n         do your children.  If you are one of those who feel so inclined\n         to name your car and other objects, you certainly don't reuse\n         your own name.  Otherwise you would have a great deal of\n         trouble distinguishing between them in speech.\n\n         For the same reason, it follows that naming your computer the\n         same thing as your car or another possession is a mistake.\n\n      Don't use long names.\n\n         This is hard to quantify, but experience has shown that names\n         longer than eight characters simply annoy people.\n\n         Most systems will allow prespecified abbreviations, but why not\n         choose a name that you don't have to abbreviate to begin with?\n         This removes any chance of confusion.\n\n      Avoid alternate spellings.\n\n         Once we called a machine \"czek\".  In discussion, people\n         continually thought we were talking about a machine called\n         \"check\".  Indeed, \"czek\" isn't even a word (although \"Czech\"\n         is).\n\n         Purposely incorrect (but cute) spellings also tend to annoy a\n         large subset of people.  Also, people who have learned English\n         as a second language often question their own knowledge upon\n         seeing a word that they know but spelled differently.  (\"I\n         guess I've always been spelling \"funxion\" incorrectly.  How\n         embarrassing!\")\n\nLibes                                                           [Page 3]\n```", "```\n [RFC 1178](/doc/html/rfc1178)                   Name Your Computer                August 1990\n\n         By now you may be saying to yourself, \"This is all very\n         silly...people who have to know how to spell a name will learn\n         it and that's that.\" While it is true that some people will\n         learn the spelling, it will eventually cause problems\n         somewhere.\n\n         For example, one day a machine named \"pythagoris\" (sic) went\n         awry and began sending a tremendous number of messages to the\n         site administrator's computer.  The administrator, who wasn't a\n         very good speller to begin with, had never seen this machine\n         before (someone else had set it up and named it), but he had to\n         deal with it since it was clogging up the network as well as\n         bogging down his own machine which was logging all the errors.\n         Needless to say, he had to look it up every time he needed to\n         spell \"pythagoris\".  (He suspected there was an abbreviation,\n         but he would have had to log into yet another computer (the\n         local nameserver) to find out and the network was too jammed to\n         waste time doing that.)\n\n      Avoid domain names.\n\n         For technical reasons, domain names should be avoided.  In\n         particular, name resolution of non-absolute hostnames is\n         problematic.  Resolvers will check names against domains before\n         checking them against hostnames.  But we have seen instances of\n         mailers that refuse to treat single token names as domains.\n         For example, assume that you mail to \"libes@rutgers\" from\n         yale.edu.  Depending upon the implementation, the mail may go\n         to rutgers.edu or rutgers.yale.edu (assuming both exist).\n\n      Avoid domain-like names.\n\n         Domain names are either organizational (e.g., cia.gov) or\n         geographical (e.g., dallas.tx.us).  Using anything like these\n         tends to imply some connection.  For example, the name \"tahiti\"\n         sounds like it means you are located there.  This is confusing\n         if it is really somewhere else (e.g., \"tahiti.cia.gov is\n         located in Langley, Virginia?  I thought it was the CIA's\n         Tahiti office!\").  If it really is located there, the name\n         implies that it is the only computer there.  If this isn't\n         wrong now, it inevitably will be.\n\n         There are some organizational and geographical names that work\n         fine.  These are exactly the ones that do not function well as\n         domain names.  For example, amorphous names such as rivers,\n         mythological places and other impossibilities are very\n         suitable.  (\"earth\" is not yet a domain name.)\n\nLibes                                                           [Page 4]\n```", "```\n [RFC 1178](/doc/html/rfc1178)                   Name Your Computer                August 1990\n\n      Don't use antagonistic or otherwise embarrassing names.\n\n         Words like \"moron\" or \"twit\" are good names if no one else is\n         going to see them.  But if you ever give someone a demo on your\n         machine, you may find that they are distracted by seeing a\n         nasty word on your screen.  (Maybe their spouse called them\n         that this morning.)  Why bother taking the chance that they\n         will be turned off by something completely irrelevant to your\n         demo.\n\n      Don't use digits at the beginning of the name.\n\n         Many programs accept a numerical internet address as well as a\n         name.  Unfortunately, some programs do not correctly\n         distinguish between the two and may be fooled, for example, by\n         a string beginning with a decimal digit.\n\n         Names consisting entirely of hexadecimal digits, such as\n         \"beef\", are also problematic, since they can be interpreted\n         entirely as hexadecimal numbers as well as alphabetic strings.\n\n      Don't use non-alphanumeric characters in a name.\n\n         Your own computer may handle punctuation or control characters\n         in a name, but most others do not.  If you ever expect to\n         connect your computer to a heterogeneous network, you can count\n         on a variety of interpretations of non-alphanumeric characters\n         in names.  Network conventions on this are surprisingly\n         nonstandard.\n\n      Don't expect case to be preserved.\n\n         Upper and lowercase characters look the same to a great deal of\n         internet software, often under the assumption that it is doing\n         you a favor.  It may seem appropriate to capitalize a name the\n         same way you might do it in English, but convention dictates\n         that computer names appear all lowercase.  (And it saves\n         holding down the shift key.)\n\n   Now that we've heard what not to do, here are some suggestions on\n   names that work well.\n\n      Use words/names that are rarely used.\n\n         While a word like \"typical\" or \"up\" (see above) isn't computer\n         jargon, it is just too likely to arise in discussion and throw\n         off one's concentration while determining the correct referent.\n         Instead, use words like \"lurch\" or \"squire\" which are unlikely\n\nLibes                                                           [Page 5]\n```", "```\n [RFC 1178](/doc/html/rfc1178)                   Name Your Computer                August 1990\n\n         to cause any confusion.\n\n         You might feel it is safe to use the name \"jose\" just because\n         no one is named that in your group, but you will have a problem\n         if you should happen to hire Jose.  A name like \"sphinx\" will\n         be less likely to conflict with new hires.\n\n      Use theme names.\n\n         Naming groups of machines in a common way is very popular, and\n         enhances communality while displaying depth of knowledge as\n         well as imagination.  A simple example is to use colors, such\n         as \"red\" and \"blue\".  Personality can be injected by choices\n         such as \"aqua\" and \"crimson\".\n\n         Certain sets are finite, such as the seven dwarfs.  When you\n         order your first seven computers, keep in mind that you will\n         probably get more next year.  Colors will never run out.\n\n         Some more suggestions are: mythical places (e.g., Midgard,\n         Styx, Paradise), mythical people (e.g., Procne, Tereus, Zeus),\n         killers (e.g., Cain, Burr, Boleyn), babies (e.g., colt, puppy,\n         tadpole, elver), collectives (e.g., passel, plague, bevy,\n         covey), elements (e.g., helium, argon, zinc), flowers (e.g.,\n         tulip, peony, lilac, arbutus).  Get the idea?\n\n      Use real words.\n\n         Random strings are inappropriate for the same reason that they\n         are so useful for passwords.  They are hard to remember.  Use\n         real words.\n\n      Don't worry about reusing someone else's hostname.\n\n         Extremely well-known hostnames such as \"sri-nic\" and \"uunet\"\n         should be avoided since they are understood in conversation as\n         absolute addresses even without a domain.  In all other cases,\n         the local domain is assumed to qualify single-part hostnames.\n         This is similar to the way phone numbers are qualified by an\n         area code when dialed from another area.\n\n         In other words, if you have choosen a reasonable name, you do\n         not have to worry that it has already been used in another\n         domain.  The number of hosts in a bottom-level domain is small,\n         so it shouldn't be hard to pick a name unique only to that\n         domain.\n\nLibes                                                           [Page 6]\n```", "```\n [RFC 1178](/doc/html/rfc1178)                   Name Your Computer                August 1990\n\n      There is always room for an exception.\n\n         I don't think any explanation is needed here.  However, let me\n         add that if you later decide to change a name (to something\n         sensible like you should have chosen in the first place), you\n         are going to be amazed at the amount of pain awaiting you.  No\n         matter how easy the manuals suggest it is to change a name, you\n         will find that lots of obscure software has rapidly accumulated\n         which refers to that computer using that now-ugly name.  It all\n         has to be found and changed.  People mailing to you from other\n         sites have to be told.  And you will have to remember that\n         names on old backup media labels correspond to different names.\n\n         I could go on but it would be easier just to forget this\n         guideline exists.\n\nConclusion\n\n   Most people don't have the opportunity to name more than one or two\n   computers, while site administrators name large numbers of them.  By\n   choosing a name wisely, both user and administrator will have an\n   easier time of remembering, discussing and typing the names of their\n   computers.\n\n   I have tried to formalize useful guidelines for naming computers,\n   along with plenty of examples to make my points obvious.  Having been\n   both a user and site administrator, many of these anecdotes come from\n   real experiences which I have no desire to relive.  Hopefully, you\n   will avoid all of the pitfalls I have discussed by choosing your\n   computer's name wisely.\n\nCredits\n\n   Thanks to the following people for suggesting some of these\n   guidelines and participating in numerous discussions on computer\n   naming: Ed Barkmeyer, Peter Brown, Chuck Hedrick, Ken Manheimer, and\n   Scott Paisley.\n\n   This essay first appeared in the Communications of the ACM, November,\n   1989, along with a Gary Larson cartoon reprinted with permission of\n   United Press Syndicate.  The text is not subject to copyright, since\n   it is work of the National Institute of Standards and Technology.\n   However, the author, CACM, and NIST request that this credit appear\n   with the article whenever it is reprinted.\n\nLibes                                                           [Page 7]\n```", "```\n [RFC 1178](/doc/html/rfc1178)                   Name Your Computer                August 1990\n\nReferences\n\n   [1]  Libes, D., \"Choosing a Name for Your Computer\", Communications\n   of the ACM, Vol. 32, No. 11, Pg. 1289, November 1989.\n\n   [2]  Mockapetris, P., \"Domain Names - Concepts and Facilities\",\n   [RFC 1034](/doc/html/rfc1034), USC/Information Sciences Institute, November 1987.\n\nSecurity Considerations\n\n   Security issues are not discussed in this memo.\n\nAuthor's Address\n\n   Don Libes\n   Integrated Systems Group\n   National Institute of Standards and Technology\n   Gaithersburg, MD 20899\n\n   Phone: (301) 975-3535\n\n   EMail:  libes@cme.nist.gov\n\nLibes                                                           [Page 8] \n```"]