["```\n*The Book of Dede Korkut is a collection of twelve stories set in the heroic age of the Oghuz Turks. The stories are peopled by characters as bizarre as they are unforgettable: Crazy Karchar, whose unpredictability requires an army of fleas to manage it; Kazan, who cheerfully pretends to necrophily in order to escape from prison; the monster Goggle-eye; and the heroine, Boghazja Fatima of the forty lovers. Geoffrey Lewis’s translation retains the odd and oddly appealing style of the stories, with their mixture of the colloquial, the poetic and the dignified, and conveys magnificently the way in which they bring to life a wild society and its inhabitants.*\n```", "```\n*Father, find me a girl who will rise before I get to my feet, who will be on horseback before I mount my well-trained horse, who before I reach my enemy will bring me some heads; that’s the sort of girl to find for me, father.*\n```", "```\n*Father, you talk of getting me married, but how can there be a girl fit for me? Before I rise to my feet she must rise; before I mount my well-trained horse she must be on horseback; before I reach the bloody infidels’ land she must have already got there and brought me back some heads.*\n```", "```\n*Summit of my black mountain, my son!\nFlood of my black river, my son!*\n```", "```\n*If all is well with the black mountains, the people go up to the summer-pasture.\nIf all is well with the blood-red rivers, they overflow in blood-red spate. \nIf all is well with the horses of the paddock, foals are born.\nLet all be well with you and with my mother\nAnd God will give you sons better than I.*\n```", "```\n*Kan Turali, you rose from your place and came\nYou mounted your black-maned Kazilik horse\nYou took your chestnut-eyed warriors\nBy night you climbed the many-coloured mountain that lies askew\nBy night you crossed its swirling river.*\n```", "```\n*I rose up from my place\nI leaped onto my black-maned Kazilik horse\nI climbed by night the many-coloured mountain that lies askew\nI forded by night the lovely eddying river.*\n```", "```\n*What has befallen my dark head!\nThe news has climbed the darkling mountains\nThe news has crossed the blood-red rivers.*\n```", "```\n*Your black mountain yonder\nHad fallen in ruin; it has risen at last.\nYour beautiful eddying river\nHad run dry; it has welled forth at last.* \n```", "```\n*I shall pray for you, my Khan: may your firm-rooted black mountain never be overthrown, may your great shady tree never be cut down, may your lovely clear-flowing river never run dry, may the tips of your wings never be broken, may God never put you in need of unworthy men, may your grey-white horse never stumble as he gallops, may your pure black steel sword never be notched in the fray, may your God-given hope never be disappointed, may the end not find you apart from the pure faith.* \n```", "```\n*For out of olde feldes, as men seith,\nCometh al this newe corn fro yeer to yere;\nAnd out of olde bokes, in good feith,\nCometh al this newe science that men lere.*\n```", "```\n*The idea behind the “method of bounds” is that the beginning point for any ecological inference should be the knowledge a researcher has for certain. This knowledge includes the fact that any proportion is by definition bound by 0 and 1\\. Furthermore, the marginals of a table, X (black population density) and T (total turnout) dictate the minimum and maximum possible values of the cells in the table. King’s method makes direct use of this information to establish absolute bounds on the values of the quantities of interest.*\n```", "```\n*The beginning point for any ecological inference should be with the knowledge we have for certain. Almost from the beginning of methodological work in this area, researchers have used the fact that proportions must by definition be between 0 and 1\\. Recently, Gary King has emphasized the particular advantages of using the precinct-by-precinct constraints. Making direct use of this information to establish absolute (i.e. not probabilistic) bounds on the percentages of the internal cells is entirely straightforward. For any single table (either of a precinct or of the state as a whole), the marginals dictate a minimum and maximum possible value for each of the cells*.\n```", "```\n*Where my fleet horse reached, the wind could not go;\nLike wolves of the tangled slopes were my warriors;\nSeven times I went there but failed to take that castle.\nYou will not prove a better man than I, my Yigenek!\nTurn back!*\n```"]