["```\ntl;dr\n\nIn 2024 the OpenWrt project turns 20 years! Let's celebrate this \nanniversary by launching our own first and fully upstream supported \nhardware design.\n\nIf the community likes the idea outlined below in greater details, we \nwould like to start a vote.\n\n---\n\nThe idea\n\nIt is not new. We first spoke about this during the OpenWrt Summits in \n2017 and also 2018\\. It became clear start of December 2023 while \ntinkering with Banana Pi style devices that they are already pretty \nclose to what we wanted to achieve in ’17/‘18\\. Banana PIs have grown in \npopularity within the community. They boot using a self compiled Trusted \nFirmware-A (TF-A)and upstream U-Boot (thx MTK/Daniel) and some of the \nboards are already fully supported by the upstream Linux kernel. The \nonly nonopen sourcecomponents are the 2.5 GbE PHYandWi-Fi firmware \nblobsrunning on separate cores that areindependent of the main SoC \nrunning Linuxand the DRAM calibration routines which are executed early \nduring boot.\n\nI contacted three project members (pepe2k, dangole, nbd) on December 6th \nto outline the overall idea. We went over several design proposals, At \nthe beginning we focused on the most powerful (and expensive) \nconfigurations possible but finally ended up with something rather \nsimple and above all,feasible. We would like to propose the following as \nour \"first\" community driven HW platform called \"OpenWrt One/AP-24.XY\".\n\nTogether with pepe2k (thx a lot) I discussed this for many hours and we \nworked out the following project proposal. Instead of going insane with \nspecifications, we decided to include some nice features we believe all \nOpenWrt supported platforms should have (e.g. being almost \nunbrickablewith multiple recovery options, hassle-free system console \naccess, on-board RTC with battery backup etc.).\n\nThis is our first design, so let's KiSS!\n\nHardwarespecifications:\n\n* SOC: MediaTek MT7981B\n* Wi-Fi: MediaTek MT7976C (2x2 2.4 GHz + 3x3/2x2 + zero-wait DFS 5Ghz)\n* DRAM: 1 GiB DDR4\n* Flash: 128 MiB SPI NAND+ 4 MiB SPI NOR\n* Ethernet: 2x RJ45 (2.5 GbE + 1 GbE)\n* USB (host): USB 2.0 (Type-A port)\n* USB (device, console): Holtek HT42B534-2 UART to USB (USB-C port)\n* Storage: M.2 2042 for NVMe SSD (PCIe gen 2 x1)\n* Buttons: 2x (reset + user)\n* Mechanical switch: 1x for boot selection (recovery, regular)\n* LEDs: 2x (PWM driven), 2x ETH Led (GPIO driven)\n* External hardware watchdog: EM Microelectronic EM6324 (GPIO driven)\n* RTC: NXP PCF8563TS (I2C) with battery backup holder(CR1220)\n* Power: USB-PD-12V on USB-C port (optional802.3at/afPoE via RT5040 module)\n* Expansion slots: mikroBUS\n* Certification: FCC/EC/RoHS compliance\n* Case: PCB size is compatible to BPi-R4 and the case design can be re-used\n* JTAG for main SOC: 10-pin 1.27 mm pitch (ARM JTAG/SWD)\n* Antenna connectors: 3x MMCX for easy usage, assembly and durability\n* Schematics: these will be publicly available (license TBD)\n* GPL compliance: 3b. \"Accompany it with a written offer ... to give any \nthird party ... a complete machine-readable copy of the corresponding \nsource code\"\n* Price: aiming for below 100$\n\nHow will the device be distributed?\n\nOpenWrt itself cannot handle this for a ton of reasons. This is why we \nspoke with the SFC early. The idea is that BPi will distribute the \ndevice using the already established channels and for every device sold \na donation will be made to ourSFC earmarked fund for OpenWrt. This money \ncan then be used to cover hosting expenses or maybe an OpenWrt summit.\n\nSFC is committed to working with us in various ways on this project — \nincluding making sure OpenWrt'strademark is properly respected, that \nthis router isabeautiful example of excellent GPL/LGPL compliance, \nandthatthis becomes a great promotional opportunity for our project and \nFOSS generally!\n\nFAQ\n\n* Why are there are 2 different flash chips?\n- the idea is to make the device (almost!) unbrickable and very easy to \nrecover\n- NAND will hold the main loader (U-Boot) and the Linux image and will \nbe the default boot device\n- NOR will be write-protected by default (with WP jumper available on \nthe board) and will hold a recovery bootloader (and other essential \ndata, like Wi-Fi calibration)\n- a dedicated boot select switch will allow changing between NOR and NAND\n\n* What will the M.2 slot be used for?\n- we will use M.2 with M-key for NVMe storage. There is a \nwork-in-progress patch to make PCIe work inside the U-Boot bootloader. \nThis will allow booting other Linux distributions such as Debian and \nAlpine directly from NVMe\n\n* Why is there no USB 3.x host port on the device?\n- the USB 3.x and PCIe buses are shared in the selected SoC silicon, \nhence only a single High-Speed USB port is available\n\n* What is the purpose of the console USB-C port?\n- Holtek UART to USB bridge with CDC-ACM support on USB-C makes the \ndevice ultra easy to communicate with. No extra hardware or drivers will \nbe required. Android for example has CDC-ACM support enabled by default\n\n* What MAC OUI will the device have?\n- we plan to register an OUI block for OpenWrt which can also be used \nfor other vendor extensions such as Wi-Fi beacon IEs\n\n* What is the purpose of the mikroBUS connector?\n- mikroBUS was chosen as we wanted to make the hardware extendable. \nThere are dedicated pins for UART, SPI, I2C buses and RST/INT signals. \nThe standard uses regular 2.54 mm pitch connectors (you can use \navailable mikroBUS modules or just connect to it something else, with \n2.54 mm jumper cables)\n\n  * Why have the RTC on board instead of a mikroBUS module?\n  - we believe there are many things a Wi-Fi (or networking in general) \ndevice should have on-board by default. Always having a correct time on \nthe device is crucial in many applications, like VPN, DNSSEC, …\n\nTimeline of events leading up to this e-mail\n\nForgive us for the lack of public communication during the initial \nphase(which as you can see was short and quick). We wanted to ensure \nthat this project is feasible before disclosing it to the community. It \nwould be a real shame if we announced something that we later found out \nto not be feasible thus failing expectations raised within the community.\n\n03.12 - initial idea\n06.12 - ping pepe2k, dangole, nbd\n07.12 - ping MediaTek and ask if this sounds doable\n08.12 - ping jow, Hauke\n08.12 - request for call with SFC, we want them involved as soon as possible\n09.12 - MediaTek replies and says they can help\n09.12 - ping apacar, ynezz, dwmm2, lynxis, rsalvaterra\n12.12 - MediaTek spoke with Banana Pi, they also like the idea\n18.12 - call with SFC (Hauke joined, we found no prior slot to talk)\n20.12 - started writing the U-Boot PCIe driver, made recovery from USB \nand android fastboot recovery work.\n... and then the end of year celebrations started and not much happened \nfor 2 weeks.\n03.01-08.01 - write this text\n\nThanks,\nSigned-off-by: Alexander Couzens <lynxis at fe80.eu>\nSigned-off-by: Bradley M. Kuhn <bkuhn at sfconservancy.org>\nSigned-off-by: Daniel Golle <daniel at makrotopia.org>\nSigned-off-by: David Bauer <mail at david-bauer.net>\nSigned-off-by: Denver Gingerich <denver at sfconservancy.org>\nSigned-off-by: Felix Fietkau <nbd at nbd.name>\nSigned-off-by: Hauke Mehrtens <hauke at hauke-m.de>\nSigned-off-by: John Crispin <john at phrozen.org>\nSigned-off-by: Jo-Philipp Wich <jo at mein.io>\nSigned-off-by: Paul Spooren <mail at aparcar.org>\nSigned-off-by: Petr Štetiar <ynezz at true.cz>\nSigned-off-by: Piotr Dymacz <pepe2k at gmail.com>\nSigned-off-by: Steven Liu <steven.liu at mediatek.com>\n\n```"]