["```\n- **Information**\n - What is (is not) going well\n - Talk about problems early, so that you can work on them\n    - If things are not going well, be clear about why and\n      what an ideal solution would be\n - Team priorities\n    - Knowing priorities will help you be proactive, and come\n      up with ideas and organise work better\n - Set clear expectations and goals\n\n- **Help** \n - Brainstorming solutions\n - Asking for resources\n\n- **Growth**\n - Receiving/Giving Feedback\n - Asking for opportunities\n - Career Planning\n```", "```\n* share your brag document with your manager\n   * They will be thankful that you are helping them remember\n     all the things that you have done\n\n* share it with your peer reviewers\n   * The people that work directly with you might remember things\n     you did for them that they want you to highlight! Remember\n     that we work in teams, and the effects that we have on others\n     are very important for great performance!\n\n* explain the big picture\n   * Why did you choose the projects you did? It is good to explain\n     your focus, and ensure that you are taking your career in the\n     correct direction\n\n* use your brag document to notice patterns\n   * What work makes you feel good, or proud? Are there themes to the\n     projects you love being involved in? Answers to these questions will\n     help you steer your career in the direction of your interests, and\n     overall work happiness\n\n* don’t forget to include the fuzzy work\n   * What to say - random tasks that improve quality of life are work too!\n     Not to be forgotten, \"1% better every day yields a LOT of improvement\n     at the end of the year\" - https://jamesclear.com/marginal-gains\n\n* encourage each other to celebrate accomplishment\n   * Let me quote Julia Evans directly: \"It can be hard to see the value\n     of your work sometimes, especially when you’re working on something\n     hard, and an outside perspective from a friend or colleague can really\n     help you see why what you’re doing is important.\"\n```", "```\n* Big Picture\n    * defining what my work overall is\n* Random untracked bits\n    * all the tiny pieces of work that don't really have a ticket\n* Area #1\n    * My main area of work\n* Project Work\n    * Projects that I have participated in regardless of the format\n      I explain what my contributions were\n* Written documentation\n  * documents I start, or things I keep updated\n```"]