["```\n\nJames A. Donald:\n  To detect and reject a double spending event in a\n  timely manner, one must have most past transactions\n  of the coins in the transaction, which, naively\n  implemented, requires each peer to have most past\n  transactions, or most past transactions that\n  occurred recently. If hundreds of millions of people\n  are doing transactions, that is a lot of bandwidth -\n  each must know all, or a substantial part thereof.\n\nSatoshi Nakamoto wrote:\n Long before the network gets anywhere near as large as\n that, it would be Safe for users to use Simplified\n Payment Verification (section 8) to check for double\n spending, which only requires having the chain of\n block headers,\n\nIf I understand Simplified Payment Verification\ncorrectly:\n\nNew coin issuers need to store all coins and all recent\ncoin transfers.\n\nThere are many new coin issuers, as many as want to be\nissuers, but far more coin users.\n\nOrdinary entities merely transfer coins.  To see if a\ncoin transfer is OK, they report it to one or more new\ncoin issuers and see if the new coin issuer accepts it.\nNew coin issuers check transfers of old coins so that\ntheir new coins have valid form, and they report the\noutcome of this check so that people will report their\ntransfers to the new coin issuer.\n\nIf someone double spends a coin, and one expenditure is\nreported to one new coin issuer, and the other\nsimultaneously reported to another new coin issuer, then\nboth issuers to swifly agree on a unique sequence order\nof payments.  This, however, is a non trivial problem of\na massively distributed massive database, a notoriously\ntricky problem, for which there are at present no peer\nto peer solutions.  Obiously it is a solvable problem,\npeople solve it all the time, but not an easy problem.\nPeople fail to solve it rather more frequently.\n\n But let us suppose that the coin issue network is\ndominated by a small number of issuers as seems likely.\n\nIf a small number of entities are issuing new coins,\nthis is more resistant to state attack that with a\nsingle issuer, but the government regularly attacks\nfinancial networks, with the financial collapse ensuing\nfrom the most recent attack still under way as I write\nthis.\n\nGovernment sponsored enterprises enter the business, in\ndue course bad behavior is made mandatory, and the evil\nfinancial network is bigger than the honest financial\nnetwork, with the result that even though everyone knows\nwhat is happening, people continue to use the paper\nissued by the evil financial network, because of network\neffects - the big, main issuers, are the issuers you use\nif you want to do business.\n\nThen knowledgeable people complain that the evil\nfinancial network is heading for disaster, that the\ngovernment sponsored enterprises are about to cause a\ncollapse of the total financial system, as Wallison\nand Alan Greenspan complained in 2005, the government\ndebates shrinking the evil government sponsored\nenterprises, as with S. 190 [109th]: Federal Housing\nEnterprise Regulatory Reform Act of 2005 but they find\neasy money too seductive, and S. 190 goes down in flames\nbefore a horde of political activists chanting that easy\nmoney is sound, and opposing it is racist, nazi,\nignorant, and generally hateful, the recent S. 190\ndebate on limiting portfolios (bond issue supporting dud\nmortgages) by government sponsored enterprises being a\nperfect reprise of the debates on limiting the issue of\nnew assignats in the 1790s.\n\nThe big and easy government attacks on money target a\nsingle central money issuer, as with the first of the\nmodern political attacks, the French Assignat of 1792,\nbut in the late nineteenth century political attacks on\nfinancial networks began, as for example the Federal\nreserve act of 1913, the goal always being to wind up\nthe network into a single too big to fail entity, and\nthey have been getting progressively bigger, more\nserious, and more disastrous, as with the most recent\none.  Each attack is hugely successful, and after the\ncataclysm that the attack causes the attackers are\nhailed as saviors of the poor, the oppressed, and the\nnation generally, and the blame for the the bad\nconsequences is dumped elsewhere, usually on Jews,\ngreedy bankers, speculators, etc, because such attacks\nare difficult for ordinary people understand.  I have\ntrouble understanding your proposal - ordinary users\nwill be easily bamboozled by a government sponsored\nsecurity update.  Further, when the crisis hits, to\ndisagree with the line, to doubt that the regulators are\nright, and the problem is the evil speculators, becomes\npolitical suicide, as it did in America in 2007,\nsometimes physical suicide, as in Weimar Germany.\n\nStill, it is better, and more resistant to attack by\ngovernment sponsored enterprises, than anything I have\nseen so far.\n\n Visa processed 37 billion transactions in FY2008, or\n an average of 100 million transactions per day.  That\n many transactions would take 100GB of bandwidth, or\n the size of 12 DVD or 2 HD quality movies, or \n```"]