["```\n\n WinRAR - What's new in the latest version\n\n   Version 7.01\n\n   1\\. Bugs fixed:\n\n      a) updating an encrypted file in a solid RAR archive produced\n         a corrupt archive if updated file was the first in archive,\n         no password was specified when starting updating and file name\n         encryption in the updated archive wasn't enabled;\n\n      b) WinRAR 7.00 crashed after switching to \"Flat folders view\" mode\n         from archive subfolder;\n\n      c) switch -ep4 duplicated the specified path instead of excluding it\n         when extracting;\n\n      d) if archive created by Unix RAR version contained symlinks with\n         path separator characters in target paths, these characters could be\n         broken when modifying such archive with Windows RAR;\n\n      e) invalid file name was displayed in file rename and file execute\n         WinRAR error messages;\n\n      f) SFX \"Shortcut\" command failed to recognize empty parameters\n         defined like \"Shortcut=D,\"\",folder\", while correctly recognizing\n         such parameters without quote marks like \"Shortcut=D,,folder\";\n\n      g) volume reconstruction didn't work in WinRAR.exe if \"rc\" command\n         was specified with .rev file, such as \"WinRAR rc arc.part1.rev\".\n         Unlike RAR, WinRAR required to use only .rar file name here.\n\n   Version 7.00\n\n   1\\. Compression dictionary sizes larger than 1 GB are supported\n      for RAR archive format. Depending on the amount of physically\n      available memory, dictionary up to 64 GB can be selected.\n\n      Not power of 2 dictionary sizes can be specified for dictionaries\n      exceeding 4 GB. So we are not limited to 4, 8, 16, 32, 64 series\n      and can use values like 5 GB or 22 GB.\n\n      Archives with dictionaries exceeding 4 GB can be unpacked only\n      by WinRAR 7.0 or newer. 64-bit WinRAR version is needed to unpack\n      archives with dictionaries exceeding 1 GB.\n\n      Increasing the dictionary size can improve the compression ratio\n      for large files with distant repeated blocks, like virtual machine\n      disk images. It also can be efficient for sets of large similar files\n      in a solid archive, such as a collection of software ISO images\n      differing by version or localization.\n\n   2\\. WinRAR issues a prompt allowing to cancel or continue if dictionary\n      size in extracted RAR archive exceeds \"Maximum dictionary size\n      allowed to extract\" parameter in \"Settings/Compression\".\n      It is done to prevent the unexpected excessive memory allocation.\n\n      In the command line mode by default WinRAR refuses to unpack archives\n      with dictionary exceeding 4 GB. Use -md <size>or -mdx <size>to allow\n      unpacking dictionaries up to and including the specified size.\n      Unlike -md<size>, -mdx <size>is applied to extraction only and can be\n      added to RAR environment variable, not affecting archiving commands.\n\n   3\\. \"Define dictionary sizes\" dialog in \"Settings/Compression\" can be used\n      to customize dictionary sizes proposed in the drop down list associated\n      with \"Dictionary size\" field in \"Archive name and parameters\" dialog.\n\n   4\\. Alternate search algorithm, optimized to locate longer and more distant\n      repeated data blocks, can be used when creating RAR archives.\n      It helps to improve the compression ratio and sometimes speed\n      for redundant data like big text files.\n\n      It increases memory usage and might reduce the compression speed\n      for some types of data. It can be turned on or off with\n      \"Long range search\" options in \"Advanced compression parameters\" dialog\n      or with -mcl[+|-] switch. If \"Auto\" option is selected, WinRAR applies\n      the long range search depending on the compression method, dictionary\n      size and other parameters.\n\n      This algorithm is required for dictionaries exceeding 4 GB\n      and turning it off is ignored for such dictionaries.\n\n   5\\. Much slower and more exhaustive repeated data search and compression\n      algorithm can be enabled with \"Exhaustive search\" option\n      in \"Advanced compression parameters\" dialog or with -mcx switch.\n      It might provide the additional compression gain for some types of\n      redundant data, but at much lower compression speed.\n\n      Long range search is needed to implement this mode efficiently,\n      so the exhaustive search option activates it automatically.\n\n      Both long range and exhaustive search option do not affect\n      the compatibility of created archives. So if dictionary size\n      is in 128 KB - 4 GB range, archives created with these search options\n      can be unpacked by all WinRAR versions beginning from 5.0.\n\n   6\\. Maximum path length limit is increased from 2047 to 65535 characters.\n\n   7\\. Creating archives in RAR 4.x format isn't supported anymore.\n      Options and switches specific for this format are removed.\n      It doesn't affect RAR 4.x archives decompression, which is included\n      into WinRAR.\n\n   8\\. \"Propagate Mark of the Web\" option in \"Settings/Security\" dialog\n      controls assigning the archive Mark of the Web to extracted files.\n      It is possible to prohibit propagating, allow it for several\n      predefined file groups, for all files or for files matching user\n      defined file masks.\n\n      Mark of the Web is the security zone information added by Internet\n      browsers to downloaded files. It can be used by various software\n      for security purposes.\n\n      It is supported only by GUI WinRAR. Console RAR doesn't propagate\n      Mark of the Web regardless of this option.\n\n   9\\. \"Attributes\" column can be enabled in \"Settings/File list/Columns\".\n      It displays file attribute abbreviations, such as 'A' for \"Archive\"\n      and 'D' for directory.\n\n      If file attribute isn't among those recognized by WinRAR,\n      the numeric value of file attributes is also displayed.\n      This value uses hexadecimal format for Windows attributes\n      or octal format for Unix attributes.\n\n  10\\. \"Benchmark\" command allows to specify the exact number of threads\n      and copy results to clipboard. Information about WinRAR and Windows\n      versions, CPU and memory is added to benchmark window.\n\n  11\\. \"Remove redundant folders from extraction path\" option\n      in \"Settings/Paths\" is now applicable also to extraction commands\n      invoked from WinRAR user interface and to multiple archives\n      unpacked to separate folders. It removes a destination path\n      component, only if its name matches both the archive name and root\n      archived folder name, provided that there are no other folders\n      or files in archive root.\n\n      For example, it will remove one of \"Pictures\" in the destination path\n      if we unpack Pictures.rar containing the root \"Pictures\" folder\n      to \"Pictures\\\" destination.\n\n      Previously it worked only for a single archive extracted from\n      context menu and didn't check if archived folder name matches\n      the last destination path component.\n\n  12\\. \"Word wrap in comment\" option in \"Interface\" options group\n      in \"Settings/General\" toggles the word wrap mode in archive comment\n      window.\n\n  13\\. Dictionary size data in archive information dialog is now available\n      for .bz2, .lz, .tar.bz2, .tar.gz, .tar.lz, .tar.zst archives.\n\n  14\\. Switch -ol- prohibits archiving and extracting symbolic links.\n\n  15\\. Switches -sl<size>[u] and -sm<size>[u] recognize [k|K|m|M|g|G|t|T]\n      size units for kilobytes, thousands of bytes, megabytes, millions\n      of bytes, gigabytes, billions of bytes, terabytes, trillions of bytes.\n      If unit character is 'b', 'B' or not present, bytes are assumed.\n\n      Previously these switches accepted bytes only.\n\n  16\\. SFX TempMode command accepts the optional @set:user parameter\n      allowing to modify temporary folder permissions, so only the current\n      user can access it. It prohibits a local user to replace files\n      in a temporary folder if SFX is started under another account.\n\n      It also can be enabled with \"Restrict folder access\" option\n      in \"Advanced SFX options/Modes\" dialog.\n\n      Some installers might fail to start in a folder created with\n      @set:user parameter.\n\n  17\\. File permissions and NTFS alternate streams are not saved for\n      hard link entries. They are saved only for the source file these\n      entries refer to. It allows to reduce the archive size, because\n      such file properties are automatically propagated to hard links\n      copies when extracting.\n\n  18\\. Keyboard shortcuts, such as Ctrl+A to select all files or Alt+E to\n      unpack found archives, are now functional in \"Search results\" window\n      also while search is still in progress. Previously they were available\n      only after completing search.\n\n  19\\. Switch -v<size>[unit] recognizes 't' and 'T' as terabytes and\n      trillions of bytes for volume size units.\n\n  20\\. Warning is issued if leading '-' character is missing in a parameter\n      specified in \"Additional switches\" field of WinRAR archiving \n      and extraction dialogs. Also it is issued for parameters lacking '-'\n      in RAR environment variable and rar.ini file.\n\n      Previously such malformed parameters were ignored silently.\n\n  21\\. \"Convert archives\" command displays the smooth total operation progress.\n      Previously the total progress was updated abruptly after converting\n      an archive and was visible only when processing multiple archives.\n\n  22\\. Proper progress is displayed when compressing symbolic link targets.\n\n  23\\. \"Integrate WinRAR into shell\" option in WinRAR \"Settings/Integration\"\n      is grayed out if \"Global\\Integration=0\" is present in winrar.ini file.\n\n  24\\. 64-bit WinRAR version uses 64-bit SFX modules by default.\n      64-bit SFX modules are needed to unpack archives with dictionaries\n      exceeding 1 GB.\n\n      32-bit modules are renamed to Default32.SFX, Zip32.SFX, WinCon32.SFX.\n\n  25\\. Maximum allowed dictionary size for archiving and extraction\n      can be specified in gigabytes in MaxDictA and MaxDictE variables\n      in \"HKEY_CURRENT_USER\\Software\\WinRAR\\Policy\" Registry key.\n      If these variables are smaller than corresponding values defined\n      in WinRAR interface, they override interface values.\n\n  26\\. Console RAR filters out character 27 from screen output. It is done\n      for security reasons, because this character can be used to declare\n      ANSI escape control sequences in some terminal applications.\n\n      We are thankful to Siddharth Dushantha for bringing this issue\n      to our attention.\n\n  27\\. Bugs fixed:\n\n      a) it was possible to overwrite Mark of the Web, propagated from\n         archive to extracted files, and modify its security zone information\n         utilizing a specially crafted .rar archive.\n\n         We are thankful to Orange Tsai and NiNi from DEVCORE Research Team\n         working with Trend Micro Zero Day Initiative for letting us know\n         about this security issue.\n\n         Unlike WinRAR, unrar.dll library doesn't propagate the archive\n         Mark of the Web and leaves it to a caller application to assign it\n         to extracted files. So unrar.dll isn't affected by this issue;\n\n      b) \"User defined archive extensions\" field in \"Settings/Integration\"\n         was not saved if winrar.ini was used to store settings\n         and WinRAR was started under non-administrator user account.\n\n   Version 6.24\n\n   1\\. Bugs fixed:\n\n      a) WinRAR and UnRAR.dll extraction command dereferenced a null pointer\n         and crashed when processing a zero length archive name\n         in the archive metadata stored with -am switch.\n\n         We are thankful to Radoslaw Madej from Check Point software\n         for reporting this issue;\n\n      b) WinRAR and UnRAR.dll extraction command overwrote extracted file\n         data with contents of ::$DATA NTFS alternate data stream,\n         if such stream was present in the archive. In this case\n         unpacked data size and checksum could mismatch file size\n         and checksum displayed in WinRAR file list. It didn't affect\n         file name and type, which were displayed properly.\n\n         We are thankful to Ata Hakcil for reporting this issue.\n\n   Version 6.23\n\n   1\\. Added extraction of XZ archives utilizing ARM64 filter.\n\n   2\\. Rar$LS* temporary files, created when extracting or testing multiple\n      archives from Windows context menu, are now deleted immediately.\n      Previously they were deleted only on next WinRAR runs and only\n      if they were at least 1 hour old.\n\n   3\\. Bugs fixed:\n\n      a) a security issue involving out of bounds write is fixed\n         in RAR4 recovery volumes processing code.\n\n         We are thankful to goodbyeselene working with Trend Micro Zero Day\n         Initiative for letting us know about this bug;\n\n      b) WinRAR could start a wrong file after a user double clicked\n         an item in a specially crafted archive.\n\n         We are thankful to Andrey Polovinkin from Group-IB Threat\n         Intelligence unit for letting us know about this bug;\n\n      c) if both NTFS and Unix time extra fields were available for a file\n         in ZIP archive, extraction command ignored the second extra field\n         even if it provided more time fields than first one;\n\n      d) interface themes were applied to archive icons even if\n         \"Apply to archive icons\" option in \"Organize themes\" dialog\n         was turned off.\n\n   Version 6.22\n\n   1\\. Bugs fixed:\n\n      a) extracting individual files from solid archives created by\n         RAR versions older than 2.0, could fail in WinRAR 6.20 and 6.21.\n         It didn't affect extracting the entire archive, which was performed\n         correctly;\n\n      b) files in Unix ARJ archives could be erroneously displayed as folders\n         in WinRAR file list;\n\n      c) \"Display files in Explorer\" extraction option was ignored\n         if \"When done: Close WinRAR\" option was also set and archive\n         was opened in WinRAR before extracting;\n\n      d) file size value in the internal viewer status bar didn't include\n         the byte order mask field, displaying a smaller than actual size\n         for Unicode files.\n\n   Version 6.21\n\n   1\\. Both file and folder modification timestamps are restored\n      when unpacking TAR and TAR based archives like tar.gz and tar.bz2.\n      Previously only file modification timestamps were set\n      for these archive formats.\n\n   2\\. Added decompression of .tar.zst archives with dictionary\n      exceeding 128 MB. WinRAR 6.20 allowed such dictionary for .zst,\n      but not for .tar.zst.\n\n   3\\. Switches -ed and -e+d are also supported by ZIP archives.\n      Previously they worked only for RAR archives.\n\n   4\\. Bugs fixed:\n\n      a) if unencrypted file was stored after encrypted in the same\n         RAR archive and both files had been unpacked in the same extraction\n         command, WinRAR 6.20 failed to unpack the unencrypted file;\n\n      b) in some cases a wrong detailed reason of file open error could be\n         displayed in the second line of open error message.\n\n   Version 6.20\n\n   1\\. If \"Autodetect passwords\" option in \"Organizer passwords\" dialog\n      is enabled and password matching a processing archive is present\n      among saved passwords, it is applied automatically. This option\n      is applicable only for archives in RAR 5.0 and ZIP formats,\n      which allow to verify the password validity quickly.\n\n      There is a minor chance of incorrect password detection\n      for ZIP archives if stored passwords do not include a proper one.\n      If encrypted ZIP archive extraction fails, you can try to disable\n      this option, repeat extraction and enter a valid password manually.\n\n   2\\. If extraction command involves only a part of files in RAR archive,\n      the additional archive analysis is performed when starting extraction.\n      It helps to properly unpack file references even if reference source\n      is not selected. It works for most of RAR archives except for volumes\n      on multiple removable media and archives containing a very large\n      number of references.\n\n      Also in some cases such analysis may help to optimize the amount\n      of processing data when extracting individual files from\n      semi-solid archives created with -s <n>and -se switches.\n\n   3\\. \"Save original archive name and time\" option on \"Options\" page\n      of archiving dialog allows to save the original archive name\n      and creation time. If archive includes such saved name and time,\n      they are displayed on \"Info\" page of \"Show information\" command\n      and can be restored on \"Options\" page of same command.\n      Restoring involves renaming an archive to original name and setting\n      the saved time as the archive creation and modification time.\n\n      Switch -ams or just -am together with archive modification commands\n      can be used to save the archive name and time in the command line mode.\n      These saved parameters are displayed in header of \"l\" and \"v\" commands\n      output and can be restored with -amr switch combined with \"ch\" command,\n      such as \"rar ch -amr arc.rar\". If -amr is specified, \"ch\" ignores\n      other archive modification switches.\n\n   4\\. Faster RAR5 compression of poorly compressible data on modern CPUs\n      with 8 or more execution threads. This applies to all methods\n      except \"Fastest\", which performance remains the same.\n\n   5\\. \"Repair\" command efficiency is improved for shuffled data blocks\n      in recovery record protected RAR5 archives.\n\n   6\\. If file size has grown after archiving when creating non-solid\n      RAR volumes, such file is stored without compression regardless of\n      volume number, provided that file isn't split between volumes.\n      Previously it worked only for files in the first volume.\n\n   7\\. Added decompression of .zipx archives containing file references,\n      provided that both reference source and target are selected\n      and reference source precedes the target inside of archive.\n\n      Typically, if .zipx archive includes file references, it is necessary\n      to unpack the entire archive to extract references successfully.\n\n   8\\. Added decompression of .zst long range mode archives with dictionary\n      exceeding 128 MB. Previously it was possible to decompress them only\n      if dictionary was 128 MB or less.\n\n   9\\. If \"Turn PC off\", \"Hibernate\", \"Sleep\" or \"Restart PC\" archiving\n      options are enabled in WinRAR, a prompt to confirm or cancel\n      such power management action is displayed directly before starting it.\n      If no selection was made by user for 30 seconds, the proposed action\n      is confirmed and started automatically.\n\n      This prompt is also displayed for -ioff switch in WinRAR command line,\n      but not in console RAR command line.\n\n  10\\. Context menu in WinRAR file list provides \"Open in internal viewer\"\n      command for archive files. It can be helpful if you wish to view\n      the archive raw data in internal viewer. For example, to read\n      an email archive with UUE attachments included.\n\n      Usual \"View\" command always displays the archive contents.\n      If file is recognized as UUE archive, \"View\" would show UUE attachments.\n\n  11\\. Recovery record size is displayed on \"Archive\" page of file properties\n      invoked from Explorer context menu for archives in RAR5 format.\n      Previously there was only \"Present\" instead of exact size\n      for RAR5 archives.\n\n  12\\. When archiving from stdin with -si switch, RAR displays the current\n      amount of read bytes as the progress indicator.\n\n  13\\. If wrong password is specified when adding files to encrypted\n      solid RAR5 archive, a password will be requested again.\n      Previous versions cancelled archiving in this case.\n\n  14\\. If both options \"Test archived files\" and \"Clear attribute \"Archive\"\n      after compressing\" or their command line -t -ac equivalents are\n      enabled when archiving, \"Archive\" attribute will be cleared only\n      if test was completed successfully. Previously it was cleared even\n      when test reported errors.\n\n  15\\. NoDrives value containing the bit mask to hide drives can be now\n      read from \"HKEY_CURRENT_USER\\Software\\WinRAR\\Policy\" Registry key,\n      which allows to include it to winrar.ini if necessary.\n      Its \"Software\\Microsoft\\Windows\\CurrentVersion\\Policies\" locations\n      in HKEY_CURRENT_USER and HKEY_LOCAL_MACHINE are also supported.\n\n      Previously only \"Software\\Microsoft\\Windows\\CurrentVersion\\Policies\"\n      in HKEY_CURRENT_USER was recognized.\n\n  16\\. Bugs fixed:\n\n      a) archive modification commands could fail for some ZIP archives\n         with file comments;\n\n      b) fixed a memory leak when reading contents of .tar.bz2 archives;\n\n      c) if source and resulting archive format is the same, the archive\n         conversion command didn't set the original archive time\n         to a newly created archive even if \"Original archive time\" option\n         was selected in archiving parameters;\n\n      d) if \"Merge volumes contents\" option in \"Settings/File list\" was\n         turned on, the folder packed size in WinRAR file list could be\n         less than expected when browsing a multivolume archive contents.\n         It didn't include the packed size of file parts continuing from\n         previous volume into calculation;\n\n      e) even if \"Set file security\" extraction option was turned off\n         by default, extraction commands in Explorer context menu still\n         attempted to restore NTFS file security data;\n\n      f) WinRAR could read data beyond the end of buffer and crash\n         when unpacking files from specially crafted ZIP archive.\n         We are thankful to Bakker working with Trend Micro Zero Day\n         Initiative for letting us know about this bug.\n\n   Version 6.11\n\n   1\\. Added support for Gz archives with large archive comments.\n      Previously the extraction command failed to unpack gz archives\n      if comment size exceeded 16 KB.\n\n   2\\. Archive comments in gz archives are displayed in the comment window\n      and recognized by \"Show information\" command. Large comments are\n      shown partially.\n\n      Previous versions didn't display Gzip comments.\n\n   3\\. Reserved device names followed by file extension, such as aux.txt,\n      are extracted as is in Windows 11 even without \"Allow potentially\n      incompatible names\" option or -oni command line switch.\n      Unlike previous Windows versions, Windows 11 treats such names\n      as usual files.\n\n      Device names without extension, such as aux, still require these\n      options to be unpacked as is regardless of Windows version.\n\n   4\\. Switch -mes can be also used to suppress the password prompt\n      and abort when adding files to encrypted solid archive.\n\n   5\\. Additional measures to prevent extracting insecure links are\n      implemented.\n\n   6\\. Bugs fixed:\n\n      a) if password exceeding 127 characters was entered when unpacking\n         an encrypted archive with console RAR, text after 127th character\n         could be erroneously recognized as user's input by different\n         prompts issued later;\n\n      b) wrong archived file time could be displayed in overwrite prompt\n         when extracting a file from ZIP archive. It happened if such\n         archive included extended file times and was created in another\n         time zone. It didn't affect the actual file time, which was set\n         properly upon extraction.\n\n   Version 6.10\n\n   1\\. WinRAR can unpack contents of .zst and .zipx archives utilizing\n      Zstandard algorithm.\n\n   2\\. Added support of Windows 11 Explorer context menus.\n\n      Beginning from Windows 11, an application can add only a single top\n      level command or submenu to Explorer context menu.\n\n      If \"Cascaded context menus\" in \"Integration settings\" dialog is on,\n      this single item is a submenu storing all necessary WinRAR commands.\n\n      If this option is off, only one extraction command for archives\n      and one archiving command for usual files are available.\n      You can select these commands with \"Context menu items...\" button\n      in \"Integration settings\" dialog.\n\n   3\\. \"Legacy context menus\" option in \"Settings/Integration\" dialog\n      can be used in Windows 11 if WinRAR commands are missing in\n      \"Show more options\" Windows legacy context menu or in context menus\n      of third party file managers. If WinRAR commands are already present\n      here, keep \"Legacy context menus\" option turned off to prevent\n      duplicating them.\n\n      This option is not available in Windows 10 and older.\n\n   4\\. Windows XP is not supported anymore. Minimum required operating\n      system version is Windows Vista.\n\n   5\\. \"Close\" item is added to \"When done\" list on \"Advanced\" page of\n      archiving dialog. It closes WinRAR window, when archiving is done.\n\n   6\\. \"When done\" list is added to \"Options\" page of extraction dialog.\n      It allows to select an action like turning a computer off\n      or closing WinRAR after completing extraction.\n\n   7\\. Switch -si can be used when extracting or testing to read archive\n      data from stdin, such as: \n\n        type docs.rar | rar x -si -o+ -pmypwd dummy docs\\\n\n      Even though the archive name is ignored with this switch,\n      an arbitrary dummy archive name has to specified in the command line.\n\n      Operations requiring backward seeks are unavailable in this mode.\n      It includes displaying archive comments, testing the recovery record,\n      utilizing the quick open information, processing multivolume archives.\n\n      Prompts requiring user interaction are not allowed.\n      Use -o[+|-|r], -p <pwd>or -mes switches to suppress such prompts.\n\n   8\\. New -ep4 <path>switch excludes the path prefix when archiving\n      or extracting if this path is found in the beginning of archived name.\n      Path is compared with names already prepared to store in archive,\n      without drive letters and leading path separators. For example:\n\n        rar a -ep4texts\\books archive c:\\texts\\books\\technical\n\n      removes \"text\\books\" from archived names, so they start\n      from 'technical'.\n\n   9\\. New -mes switch skips encrypted files when extracting or testing.\n      It replaces the former -p- switch.\n\n  10\\. New -op <path>switch sets the destination folder for 'x' and 'e'\n      extraction commands. Unlike <path_to_extract>command line parameter,\n      this switch also accepts paths without trailing path separator\n      character.\n\n  11\\. If 'p' command is used to print a file to stdout, informational\n      messages are suppressed automatically to prevent them mixing\n      with file data.\n\n  12\\. \"Generate archive name by mask\" option and switch -ag treat only\n      first two 'M' characters after 'H' as minutes. Previously any\n      amount of such characters was considered as minutes.\n\n      It makes possible to place the time field before the date,\n      like -agHHMM-DDMMYY. Previous versions considered all 'M'\n      in this string as minutes.\n\n  13\\. Maximum allowed size of RAR5 recovery record is increased to 1000%\n      of protected data size. Maximum number of RAR5 recovery volumes\n      can be 10 times larger than protected RAR volumes.\n\n      Previous WinRAR versions are not able to use the recovery record\n      to repair broken archives if recovery record size exceeds 99%.\n      Similarly, previous versions cannot use recovery volumes\n      if their number is equal or larger than number of RAR volumes.\n\n  14\\. Warning is issued if entered password exceeds the allowed limit\n      of 127 characters and is truncated. Previously such passwords\n      had been truncated silently.\n\n  15\\. If archive includes reserved device names, the underscore character\n      is inserted in the beginning of such names when extracting.\n      For example, aux.txt is converted to _aux.txt. It is done to prevent\n      compatibility problems with software unable to process such names.\n\n      You can use \"Allow potentially incompatible names\" option\n      in \"Advanced\" part of extraction dialog or command line -oni switch\n      to avoid this conversion.\n\n  16\\. WinRAR attempts to reset the file cache before testing an archive.\n      It helps to verify actual data written to disk instead of reading\n      a cached copy.\n\n  17\\. Multiple -v <size>switches specifying different sizes for different\n      volumes are now allowed also for ZIP archives:\n\n      WinRAR a -v100k -v200k -v300k arcname.zip\n\n      Previously multiple -v <size>switches were supported only for\n      RAR archives.\n\n  18\\. Switches -sl <size>and -sm <size>can be used in WinRAR.exe command\n      line mode when extracting archives in any supported formats,\n      provided that such archive includes unpacked file sizes.\n      Previously these switches could filter files by size only in RAR\n      and ZIP archives.\n\n  19\\. Newer folder selection dialog is invoked when pressing \"Browse\" button\n      in WinRAR \"Settings/Paths\" page, \"Repair\" and \"Convert\" commands,\n      also as in few other similar places. Previously a simpler XP style\n      folder selection dialog was opened.\n\n  20\\. When restoring from tray after completing an operation,\n      WinRAR window is positioned under other opened windows,\n      to not interfere with current user activities.\n\n  21\\. \"650 MB CD\" is removed and \"2 GB volumes\" is added to the list of\n      predefined volume sizes in \"Define volume sizes\" dialog invoked\n      from WinRAR \"Settings/Compression\".\n\n  22\\. \"Rename\" command selects the file name part up to the final dot.\n      Previously it selected the entire name.\n\n  23\\. If SFX archive size exceeds 4 GB, an error message is issued\n      during compression, immediately after exceeding this threshold.\n      Previously this error was reported only after completing compression.\n\n      Executables of such size cannot be started by Windows.\n\n  24\\. Command line -en switch is not supported anymore.\n      It created RAR4 archives without the end of archive record.\n\n      End of archive record permits to gracefully skip external data\n      like digital signatures.\n\n  25\\. Bugs fixed:\n\n      a) when editing a file inside of .rar or .zip archive,\n         WinRAR created a new SFX archive instead of updating an existing \n         archive if \"Create SFX archive\" option was set in the default\n         compression profile;\n\n      b) the total progress could be displayed incorrectly when using\n         -oi, -f, -u switches or appropriate GUI options;\n\n      c) \"Find files\" command with \"Use all tables\" option and command line\n         \"it\" commands failed to find strings in UTF-16 encoding.\n\n   Version 6.02\n\n   1\\. ZIP SFX module refuses to process SFX commands stored in archive\n      comment if such comment is resided after beginning of Authenticode\n      digital signature. It is done to prevent possible attacks with\n      inclusion of ZIP archive into the signature body.\n\n      We already prohibited extracting contents of such malformed archives\n      in WinRAR 6.01.\n\n      We are thankful to Jacob Thompson - Mandiant Advantage Labs\n      for reporting this issue.\n\n   2\\. WinRAR uses https instead of http in the web notifier window,\n      home page and themes links. It also implements additional checks\n      within the web notifier. This is done to prevent a malicious web page\n      from executing existing files on a user's computer. Such attack\n      is only possible if the intruder has managed to spoof or otherwise\n      control user's DNS records. Some other factors are also involved\n      in limiting the practical application of this attack.\n\n      We would like to express our gratitude to Igor Sak-Sakovskiy\n      for bringing this issue to our attention.\n\n   3\\. Where appropriate, SFX archive displays the additional line\n      with detailed error information provided by operating system.\n\n      For example, previously such archive would display \"Cannot create file\"\n      message alone. Now this message is followed by a detailed reason\n      like access denied or file being used by another process.\n\n      In the past this extended error information was available in WinRAR,\n      but not in SFX archives.\n\n   4\\. Switch -idn hides archived names also in 'v' and 'l' commands.\n      It can be useful if only the archive type or total information\n      is needed.\n\n   5\\. If -ibck -ri <priority>switches are used together, WinRAR process\n      sets the priority specified in -ri switch. Previous versions ignored\n      -ri and set the priority to low in the presence of -ibck switch.\n\n   6\\. When using \"File/Change drive\" command, WinRAR saves the last folder\n      of previous drive and restores it if that drive is selected again\n      later.\n\n   7\\. Name of unpacking file is now included into WinRAR incorrect password\n      warning for RAR5 archives. It can be helpful when unpacking\n      a non-solid archive containing files encrypted with different passwords.\n\n   8\\. Bugs fixed:\n\n      a) \"Convert archives\" command issued erroneous \"The specified password\n         is incorrect\" message after succesfully converting RAR archive\n         with encrypted file names if new password was set and archive\n         was opened in WinRAR shell;\n\n      b) if command progress window was resized up and then quickly resized\n         down to original dimensions, window contents could be positioned\n         incorrectly.\n\n   Version 6.01\n\n   1\\. Ctrl+A keyboard shortcut selects the entire text in WinRAR comment\n      window.\n\n   2\\. If -idn switch is used together with -t or -df in console RAR\n      when archiving, it additionally disables \"Deleting <filename>\"\n      or \"Testing <filename>\" messages, normally issued by these switches.\n\n      Also -idn disables folder creation messages when extracting\n      a file to non-existing folder.\n\n   3\\. WinRAR and ZIP SFX module refuse to extract contents of ZIP SFX\n      archives if ZIP central directory is resided after beginning\n      of Authenticode digital signature. It is done to prevent possible\n      attacks with inclusion of ZIP archive into signature body.\n\n   4\\. Bugs fixed:\n\n      a) \"Convert archives\" command could incorrectly convert Unicode\n         comments in RAR archives.\n\n      b) if two archive information windows had been opened from Explorer\n         context menu, the compression ratio bar in the first window\n         could erroneously display a value for second archive.\n\n         It did not affect the ratio and other text details at the right\n         of window. Only the vertical bar at the left could be updated\n         to a wrong value;\n\n      c) if \"Wait if other WinRAR copies are active\" option was enabled\n         in extraction dialog, \"Waiting for another WinRAR copy\" title\n         was not set in command progress window while waiting;\n\n      d) when extracting a symbolic link, previous versions did not\n         overwrite existing symbolic links even if user requested it\n         in overwrite prompt.\n\n   Version 6.00\n\n   1\\. \"Ignore\" and \"Ignore All\" options are added to read error prompt.\n      \"Ignore\" allows to continue processing with already read file part\n      only and \"Ignore All\" does it for all future read errors.\n\n      For example, if you archive a file, which portion is locked by another\n      process, and if \"Ignore\" is selected in read error prompt,\n      only a part of file preceding the unreadable region will be saved\n      into archive.\n\n      It can help to avoid interrupting lengthy archiving operations,\n      though be aware that files archived with \"Ignore\" are incomplete.\n\n      If switch -y is specified, \"Ignore\" is applied to all files by default.\n\n      Previously available \"Retry\" and \"Quit\" options are still present\n      in read error prompt as well.\n\n   2\\. Exit code 12 is returned in the command line mode in case of read errors.\n      This code is returned for all options in the read error prompt,\n      including a newly introduced \"Ignore\" option.\n\n      Previously more common fatal error code 2 was returned for read errors.\n\n   3\\. If several archives are selected, \"Extract archives to\" option group\n      in \"Options\" page of extraction dialog can be used to place extracted\n      files to specified destination folder, to separate subfolders\n      in destination folder, to separate subfolders in archive folders\n      and directly to archive folders.\n\n      It replaces \"Extract archives to subfolders\" option and available\n      only if multiple archives are selected.\n\n   4\\. New -ad2 switch places extracted files directly to archive's own folder.\n      Unlike -ad1, it does not create a separate subfolder for each unpacked\n      archive.\n\n   5\\. \"Additional switches\" option in \"Options\" page of archiving\n      and extraction dialogs allows to specify WinRAR command line switches.\n      It might be useful if there is no option in WinRAR graphical interface\n      matching a switch.\n\n      Use this feature only if you are familiar with WinRAR command line\n      syntax and clearly understand what specified switches are intended for.\n\n   6\\. Compression parameters in \"Benchmark\" command are changed to\n      32 MB dictionary and \"Normal\" method. They match RAR5 default mode\n      and more suitable to estimate the typical performance of recent\n      WinRAR versions than former 4 MB \"Best\" intended for RAR4 format.\n\n      Latest \"Benchmark\" results cannot be compared with previous versions\n      directly. New parameters set produces different values, likely lower\n      because of eight times larger dictionary size.\n\n   7\\. When unpacking a part of files from solid volume set,\n      WinRAR attempts to skip volumes in the beginning and start\n      extraction from volume closest to specified file and with reset\n      solid statistics.\n\n      By default WinRAR resets the solid statistics in the beginning\n      of large enough solid volumes where possible. For such volumes\n      extracting a part of files from the middle of volume set can be\n      faster now.\n\n      It does not affect performance when all archived files are unpacked.\n\n   8\\. Previously WinRAR automatically resorted to extracting from\n      first volume, when user started extraction from non-first volume\n      and first volume was available. Now WinRAR does so only if all volumes\n      between first and specified are also available.\n\n   9\\. Warning is issued when closing WinRAR if one or more archived files\n      had been modified by external apps, but failed to be saved back to\n      archive, because an external app still locks them. Such warning\n      includes the list of modified files and proposes to quit immediately\n      and lose changes or return to WinRAR and close an editor app.\n\n      Previous versions issued a similar warning while editing a file,\n      but did not remind it again when quitting.\n\n  10\\. \"Move to Recycle Bin\" option in \"Delete archive\" options group\n      of extraction dialog places deleted archives to Recycle Bin\n      instead of deleting them permanently.\n\n  11\\. New \"Clear history...\" command in \"Options\" menu allows to remove\n      names of recently opened archives in \"File\" menu and clear drop down\n      lists with previously entered values in dialogs. For example,\n      these values include archive names in archiving dialog\n      and destination paths in extraction dialog.\n\n  12\\. \"File time\" options in \"Advanced\" part of extraction dialog are\n      now available for 7z archives. Additionally to modification time,\n      WinRAR can set creation and last access time when unpacking such\n      archives.\n\n  13\\. \"\"New\" submenu items\" options group is added to\n      \"Settings/Integration/Context menu items...\" dialog. You can use\n      these options to remove \"WinRAR archive\" and \"WinRAR ZIP archive\"\n      entries in \"New\" submenu of Windows context menu.\n\n      New state of these option is applied only after you press \"OK\"\n      both in \"Context menu items\" and its parent \"Settings\" dialog.\n\n  14\\. <max>, <min>and <hide>commands can be inserted before the program\n      name in SFX \"Setup\" command to run a program in maximized,\n      minimized or hidden window. For example:\n\n      Setup=<hide>setup.exe\n\n  15\\. It is possible to specify an additional high resolution logo\n      for SFX module. If such logo is present, SFX module scales\n      and displays it in high DPI Windows mode, providing the better visible\n      quality compared to resizing the standard logo.\n\n      Use \"High resolution SFX logo\" in \"Advanced SFX options\" dialog\n      to define such logo. In command line mode add second -iimg switch\n      to set the high resolution logo.\n\n      Recommended size of high resolution logo PNG file is 186x604 pixels.\n\n  16\\. If archive currently opened in WinRAR shell was deleted or moved\n      by another program, WinRAR displays \"Inaccessible\" before archive name\n      in the window title. Also it flashes the window caption and taskbar\n      button.\n\n  17\\. \"Total information\" option in \"Report\" dialog is renamed to\n      \"Headers and totals\". Now it also adds headers of report columns\n      additionally to total information about listed files and archives.\n\n  18\\. If archive processing is started from Windows context menu\n      in multiple monitor system, WinRAR operation progress and dialogs\n      use the monitor with context menu.\n\n      While basic multiple monitor support was present in previous versions\n      shell extension for mouse driven commands, now it is extended to\n      operations initiated from keyboard and to dropping files to archives.\n\n  19\\. New -imon <number>switch allows to select a monitor to display\n      WinRAR operation progress and dialogs in the command line mode.\n\n      Use -imon1 for primary and -imon2 for secondary monitor.\n      For example, \"WinRAR x -imon2 arcname\" will start extraction\n      on secondary monitor.\n\n      It works only in the command line mode and does not affect\n      interactive WinRAR graphical inteface also as console RAR.\n\n  20\\. Switch -idn hides archived names output in archiving, extraction\n      and some other commands in console RAR. Other messages and total\n      percentage are not affected.\n\n      You can use this switch to reduce visual clutter and console output\n      overhead when archiving or extracting a lot of small files.\n\n      Minor visual artifacts, such as percentage indicator overwriting\n      few last characters of error messages, are possible with -idn.\n\n  21\\. Former \"-im - show more information\" switch is changed to\n      \"-idv - display verbose output\" for consistency with console RAR\n      -id[c,d,p,q] message control options and avoid a potential name\n      conflict with newer -imon switch.\n\n      While WinRAR still recognizes both -im and -idv, in the future\n      -im support can be dropped.\n\n  22\\. It is allowed to add an optional %arcname% variable to compression\n      profile name. Such variable will be replaced with actual archive name.\n      It might be convenient when using with \"Add to context menu\" profile\n      option. For example, you can create ZIP compression profile\n      and set its name to \"Add to %arcname%\", to display it with actual\n      ZIP archive name in context menu.\n\n  23\\. Ctrl+C and Ctrl+Ins keyboard shortcuts can be used\n      in \"Diagnostic messages\" window to copy contents to clipboard.\n\n  24\\. More text is allowed in tray icon hint before a lengthy text\n      is truncated. Also such text is now truncated in the middle of string,\n      so both command type and completion percentage are still visible.\n\n  25\\. In case of clean install, if previous version compression profiles\n      are not present, \"Files to store without compression\" field\n      in newly created predefined compression profiles is set to:\n\n        *.rar *.zip *.cab *.7z *.ace *.arj *.bz2 *.gz *.lha *.lzh\n        *.taz *.tgz *.xz *.txz\n\n      You can change this field and save a modified value to compression\n      profile later.\n\n      Previous versions set this field to blank for clean install.\n\n  26\\. Destination path history in extraction dialog treats paths like\n      'folder' and 'folder\\' as the same path and displays only 'folder'\n      entry. Previously they occupied two entries in the history.\n\n  27\\. \"Enable Itanium executable compression\" GUI option and -mci command\n      line switch are removed. Optimized compression of Itanium executables\n      is not supported anymore. WinRAR still can decompress already existing\n      archives utilizing Itanium executable compression.\n\n  28\\. Bugs fixed:\n\n      a) \"Lock\", \"Comment\" and \"Protect\" commands could not be applied\n         to several archives selected in WinRAR file list at once;\n\n      b) SFX archive process did not terminate after completing\n         extraction in Windows 10 if archive comment included \"Setup\"\n         and \"SetupCode\" commands, did not include \"TempMode\" command\n         and setup program was running for more than 8 minutes;\n\n      c) compression profiles with quote character in profile name\n         could not be invoked from Explorer context menu.</number></hide></hide></min></max></filename></filename></priority></size></size></size></size></path_to_extract></path></path></pwd></n></size></size></size></size></size></size></size> \n\n```"]